artshare_api/app/controllers/artwork_shares_controller.rb

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artist_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
     def index
    render json: ArtworkShare.find_by(artist_id: params[:artist_id])

INSERT INTO "artwork_shares" ("artwork_id", "artist_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 2], ["artist_id", 2]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save