artshare_api/app/controllers/artworks_controller.rb

     def index
    render json: Artwork.find_by(artist_id: params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "jeffrey"], ["image_url", "\"httpdsasad\""], ["artist_id", 2], ["updated_at", "2019-12-10 23:41:55.839866"], ["id", 2]]