cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @cats = Cat.all.sort

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", "                \r\n    Shes a girl\r\n    "], ["updated_at", "2019-12-12 00:31:06.574383"], ["id", 4]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)